-- 서브쿼리(SUBQUERY)

-- 문제1.
-- 현재 평균 급여보다 많은 급여을 받는 직원은 몇 명이나 있습니까?

-- 문제2. (X)
-- 현재, 각 부서별로 최고의 급여를 받는 사원의 사번, 이름, 부서 연봉을 조회하세요. 단 조회결과는 급여의 내림차순으로 정렬되어 나타나야 합니다. 

-- 문제3.
-- 현재, 자신의 부서 평균 급여보다 급여(salary)가 많은 사원의 사번, 이름과 급여을 조회하세요 

-- 문제4.
-- 현재, 사원들의 사번, 이름, 매니저 이름, 부서 이름으로 출력해 보세요.

-- 문제5.
-- 현재, 평균급여가 가장 높은 부서의 사원들의 사번, 이름, 직책, 급여를 조회하고 급여 순으로 출력하세요.

-- 문제6.
-- 평균 급여가 가장 높은 부서는? 
-- 부서이름, 평균 급여

-- 문제7.
-- 평균 급여가 가장 높은 직책?
-- 직책, 평균급여

-- 문제8.
-- 현재 자신의 매니저보다 높은 급여를 받고 있는 직원은?
-- 부서이름, 사원이름, 연봉, 매니저 이름, 매니저 급여 순으로 출력합니다.

